{"title":"English Writing 03","date":"2019-10-30T02:19:50.000Z","date_formatted":{"ll":"2019年10月30日","L":"2019/10/30","MM-DD":"10-30"},"author":"loving-English Anastasia","thumbnail":"https://s2.ax1x.com/2020/02/27/3wBnk6.jpg","link":"2019/10/30/writing03","comments":true,"tags":["Loving English"],"categories":["English Writing"],"updated":"2020-02-27T09:56:58.035Z","content":"<p>endure, erode</p>\n<a id=\"more\"></a>\n<h2><span id=\"how-does-the-book-look-like\">How does the book look like?</span></h2>\n<p><img src=\"https://s2.ax1x.com/2019/10/30/KhKb24.png\" alt=\"space\" class=\"φcx\"></p>\n<h2><span id=\"how-to-get-one\">How to get one?</span></h2>\n<a href=\"https://shop16653392.m.youzan.com/wscgoods/detail/2xa7l3pn0sp5k?redirect_count=1\" title target>Buy it!</a>\n<p>´●_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ٩( ‘ω’ )و  get! _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _●`</p>\n<h2><span id=\"1-endure\">1. endure</span></h2>\n<h3><span id=\"-1-if-you-endure-a-painful-or-difficult-situation-you-experience-it-and-do-not-avoid-it-or-give-up-usually-because-you-cannot\">-1. If you endure a painful or difficult situation, you experience it and do not avoid it or give up, usually because you cannot.</span></h3>\n<pre><code> Eg. The company endure heavy financial losses.\n     We had to endure a nine-hour delay at the airport.\n     She's already had to endure three painful operations on her leg.\n     We seek the truth, and will endure the consequences.\n     He can't endure criticism.\n</code></pre>\n<h3><span id=\"-2-if-something-endures-it-continues-to-exist-without-any-loss-in-quality-or-importance\">-2. If something endures, it continues to exist without any loss in quality or importance.</span></h3>\n<pre><code> Eg. Somehow the language endures and continues to survive.\n     The political system established in 1400 endures until about 1650.\n     friendships which endure over many years\n     His work will endure for centuries.\n</code></pre>\n<p>【教育】Exam-oriented education has endured since the resumption of the college entrance exam, and educators believe that it is time to promote quality education.<br>\n【科技】 Due to the lack of supervision of online comments, many innocent people are enduring cyberbullying and have nowhere to complain.<br>\n【环境】People’s efforts to cope with air pollution have endured for many years, and they have indeed achieved remarkable results.<br>\n【传统文化】There have been countless wars and disasters in China’s history, but traditional Chinese culture endured and moved forward.<br>\n【青少年犯罪】Many people who commit crimes endured child neglet or even domestic violence when they were young.<br>\n【健康】There are fewer and fewer types of antibiotics that can eliminate malignant bacteria, which is bad news for patients enduring illness.<br>\n【合作】Consistent goals, mutual support and active communication among team members can make teamwork endure.<br>\n【成功】Those who have endured hardships can see setbacks in a positive light and make every effort to overcome them.</p>\n<h2><span id=\"2-erode\">2. erode</span></h2>\n<h3><span id=\"-if-someones-authority-right-or-confidence-erodes-or-is-eroded-it-is-gradually-destroyed-or-removed\">-If someone’s authority, right, or confidence erodes or is eroded, it is gradually destroyed or removed.</span></h3>\n<pre><code> Eg. America's believe in its own God-ordained uniqueness started to erode.\n     His behaviour over the last few months has eroded my confidence in his judgment.\n     Our personal freedom is being gradually eroded away. \n</code></pre>\n<p>【教育】Without guidance from parents and teachers, children’s confidence can easily be eroded by difficulties, which will make them become frustrated, and eventually give up the goal.<br>\n【科技】The widespread use of the Internet has given people more access to information and the right to speak, which can erode the authority of experts.<br>\n【环境】Increasing green areas can effectively prevent soil erosion, thereby reducing dusty conditions and improving air quality.<br>\n【传统文化】With the increasing exchanges between countries, traditional culture runs the risk of being eroded by foreign influences.<br>\n【青少年犯罪】The physical and mental development of young people is still not complete, which means that they are easily eroded by violent and sexual content on television or in movies.<br>\n【健康】Excessive work pressure, high-calorie diets and irregular schedules are constantly eroding young people’s physical and mental health.<br>\n【合作】Suspicion and prejudice are cancers that erode cooperation.<br>\n【成功】Only by sticking to the right goals and resisting the erosion of laziness, inferiority and fear can we finally succeed.</p>\n","prev":{"title":"English Writing 04","link":"2019/10/31/writing04"},"next":{"title":"English Writing 02","link":"2019/10/29/writing02"},"plink":"https://venanastasia.github.io/2019/10/30/writing03/","toc":[{"id":null,"title":"How does the book look like?","index":"1"},{"id":null,"title":"How to get one?","index":"2"},{"id":null,"title":"1. endure","index":"3","children":[{"id":null,"title":"-1. If you endure a painful or difficult situation, you experience it and do not avoid it or give up, usually because you cannot.","index":"3.1"},{"id":null,"title":"-2. If something endures, it continues to exist without any loss in quality or importance.","index":"3.2"}]},{"id":null,"title":"2. erode","index":"4","children":[{"id":null,"title":"-If someone’s authority, right, or confidence erodes or is eroded, it is gradually destroyed or removed.","index":"4.1"}]}],"copyright":{"author":"loving-English Anastasia","license":"Attribution-NonCommercial-NoDerivatives 4.0 International"}}