{"title":"Sentence Patterns 05","date":"2019-11-19T05:14:27.000Z","date_formatted":{"ll":"2019年11月19日","L":"2019/11/19","MM-DD":"11-19"},"author":"loving-English Anastasia","thumbnail":"https://s2.ax1x.com/2020/02/27/3wBQpD.jpg","link":"2019/11/19/sentence05","comments":true,"tags":["Loving English"],"categories":["English Writing"],"updated":"2020-04-10T12:50:15.205Z","content":"<p>状语从句</p>\n<a id=\"more\"></a>\n<h2><span id=\"how-does-the-book-look-like\">How does the book look like?</span></h2>\n<p><img src=\"https://s2.ax1x.com/2019/10/30/KhKb24.png\" alt=\"space\" class=\"φcx\"></p>\n<h2><span id=\"how-to-get-one\">How to get one?</span></h2>\n<a href=\"https://shop16653392.m.youzan.com/wscgoods/detail/2xa7l3pn0sp5k?redirect_count=1\" title target>Buy it!</a>\n<p>´●_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ٩( ‘ω’ )و  get! _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _●`</p>\n<h1><span id=\"状语从句\">状语从句</span></h1>\n<ol>\n\t<li>as long as</li>\n\t<li>If...should do</li>\n\t<li>Just as..., so...</li>\n\t<li>no more..., than</li>\n\t<li>now that...</li>\n\t<li>so that...</li>\n\t<li>so...that...</li>\n\t<li>the more..., the more...</li>\n\t<li>whenever</li>\n</ol>\n<h2><span id=\"1-as-long-as\">1. as long as</span></h2>\n<h3><span id=\"as-long-as-s-v-该句型与only-if-on-the-condition-that-provided-that意思相同表未来条件时要用现在式代替未来式\"><code>as long as + S. +V., 该句型与only if、on the condition that、provided (that)意思相同，表未来条件时，要用现在式代替未来式。</code></span></h3>\n<p>很多人认为成功一定会到来，只要他们坚持自己的目标。<br>\nMany prople believe that success will come, as long as they stick to their goals.</p>\n<p>科技总是会造福人类的，只要我们把它运用到正确的地方上去。<br>\nTechnology will always benefit us, as long as we use it in the right way.</p>\n<p>青山绿水一定会回到我们身边，只要我们采取切实有效的办法来保护环境，比如对高污染工厂实施罚款。<br>\nGreen mountains and clean water will definitely come back to us, as long as we take effective measures to protect the environment, such as imposing fines on high pollution factories.</p>\n<h3><span id=\"as-long-as-还可以用来修饰名词表示尺寸-距离-时间的长度\"><code>as long as 还可以用来修饰名词，表示“（尺寸、距离、时间）的长度。</code></span></h3>\n<p>幼年时期的创伤要花数长达数十年的时间才能痊愈。<br>\nChildhood trauma will take as long as decades to heal.</p>\n<p>大自然需要长达从、数百年的时间来抵消工厂排放的污染物的影响。<br>\nIt will take as long as hundreds of years for nature to offset the effects of pollutants emitted by factories.</p>\n<h2><span id=\"2-ifshould-do\">2. If…should do</span></h2>\n<h3><span id=\"if-s-过去式s-couldshouldwould此句型用来表示与现在事实相反的假设if从句要用过去式主从句用过去式助动词-v\"><code>If + S. +过去式，S.+ could/should/would，此句型用来表示与现在事实相反的假设，if从句要用过去式，主从句用“过去式助动词 + V.”。</code></span></h3>\n<p>如果政府官员按他们承诺的那样落实保护环境的措施，那我们的环境早就应该会更好的。<br>\nIf government officials implemented measures to protect the environment as they promised, our environment should have been better.</p>\n<p>如果家长们愿意倾听孩子的想法，给他们足够多的关注，那这些孩子就不会犯罪。<br>\nIf parents were willing to listen to their children’s ideas and give them enough attention, these children would not commit crimes.</p>\n<h2><span id=\"3-just-as-so\">3. Just as…, so…</span></h2>\n<h3><span id=\"本句型用来比较两相似的情况as引导状态状语从句so也作副词用表示也是之后接从句或将主语与主动词对调形成倒装\"><code>本句型用来比较两相似的情况，as引导状态状语从句，so也作副词用，表示“也是”，之后接从句，或将主语与主动词对调形成倒装。</code></span></h3>\n<h3><span id=\"just-as-s-vso-s-v\"><code>(Just) as + S. + V.,so + S. + V.</code></span></h3>\n<h3><span id=\"just-as-s-vso-助动词-s\"><code>(Just) as + S. + V.,so + 助动词 + S.</code></span></h3>\n<p>正如我们不会把垃圾丢到我们自己家客厅一样的地板上一样，我们也不应该在公共场所乱丢垃圾。<br>\nJust as we would not throw garbage on our living room floor, so we should not litter in public places.</p>\n<p>正如我们自己希望得到理解那样，孩子也一样。<br>\nJust as we hope to be understood, so do children.</p>\n<p>正如我们渴望与外面世界时时刻刻保持紧密联系一样，老年人也渴望。<br>\nJust as we are eager to stay in close contact with the outside world, so are the elderly.</p>\n<p>正如你希望自己的意见被合作伙伴尊重，对方也一样，所以平等、友好、真诚的沟通是一切合作的基础。<br>\nJust as you want your opinions to be valued by your partners, so do other people. Therefore, I believe that equality, friendship and effective communication are the foundation of all cooperation.</p>\n<h2><span id=\"4-no-more-than\">4. no more…, than</span></h2>\n<h3><span id=\"no-morethan句型表面上看起来是表示不同的比较但实际上是表示同等关系用来强调两者均不\"><code>no more...than句型表面上看起来是表示不同的比较，但实际上是表示同等关系，用来强调“两者均不……”。</code></span></h3>\n<p>现在的孩子并没有比几十年前的孩子了解更多性知识。<br>\nToday’s children do not know more about sex than children decades ago.</p>\n<p>即使被高科技应用包围，现代人并不比以前的人幸福多少。<br>\nEven if surrounded by high-tech applications, modern people are no more happy than people in the past.</p>\n<p>一个没有新鲜空气的城市不能称之为家园，就像没有食物的草原不能称之为栖息地。<br>\nA city without fresh air is no more a home than a grassland without food is a habitat.</p>\n<p>没有自由的教育和没有灵魂的身体一样，都是不可持续的。<br>\nEducation without freedom is no more unsustainable than a body without a soul.</p>\n<p>没有相互理解的合作就跟没有交流的婚姻一样，都是不长久的。<br>\nCooperation without mutual understanding is no more long-lasting than a marriage without communication.</p>\n<h2><span id=\"5-now-that\">5. now that…</span></h2>\n<h3><span id=\"now-that引导原因状语从句用来说明某人决定做某事的理由通常是对方已知的讯息\"><code>now that引导原因状语从句，用来说明某人决定做某事的理由，通常是对方已知的讯息。</code></span></h3>\n<p>既然环境已经快速恶化，我们还有什么理由不行动起来。<br>\nNow that the environment has deteriorated rapidly, we do not have any reason not to act.</p>\n<p>考虑到现在已经有很多人沉迷游戏不能自拔，高科技产品最后会把我们奴役的可能性是存在的。<br>\nThere is a possibility that high-tech products will eventually enslave us, now that many people are addicted to online games.</p>\n<p>考虑到现代人的工作压力越来越大，心理问题越来越该被重视。<br>\nNow that the work pressure of modern people is getting higher and higher, mental problems should be paid more and more attention.</p>\n<p>考虑到很多孩子对学校里的课程并不感兴趣，教育者应该根据儿童的实际需求设计更有趣味性的课程。<br>\nNow that many children are not interested in the school, it is true that educators should design more interesting courses based on children’s need.</p>\n<h2><span id=\"6-so-that\">6. so that…</span></h2>\n<h3><span id=\"s-v-so-that-s-助动词-v该句型中so-that引导的从句用来表目的从句中常出现can-could-will-would-may-might等助动词在口语中that可省略\"><code>S. + V. + so that + S. +助动词+ V.，该句型中so that引导的从句用来表目的，从句中常出现can, could, will, would, may, might等助动词，在口语中that可省略。</code></span></h3>\n<p>电影和电视应该减少对暴力的宣扬，这样青少年不至于被误导。<br>\nMovies and TV shows should reduce the promotion of violence so that teenagers will not be misled.</p>\n<p>现代人要注意自己的饮食习惯，不要摄入太多的脂肪，这样才能保持身体健康。<br>\nModern people should pay attention to their eating diets and do not consume too much fat, so that they can maintain good health.</p>\n<p>在与他人合作的过程中，彼此要做到互相尊重，这样合作才是有效的。<br>\nIn the process of working with others, mutual respect must be guaranteed, so that cooperation is effective.</p>\n<p>对环境的保护绝不能停留在喊口号的阶段，而是应该有实际的行动，这样我们就能呼吸到新鲜的空气，迟到没有污染的食物。<br>\nTo protect the environment, we should not simply talk the talk, but should walk the walk, so that we can breathe the fresh air and eat uncontaminated food.</p>\n<h2><span id=\"7-sothat\">7. so…that…</span></h2>\n<h3><span id=\"so-adjadv-that-s-v此句型用来表示如此以致于有结果\"><code>so + adj./adv. that + S. + V.，此句型用来表示“如此……以致于（有……结果）”。</code></span></h3>\n<p>信息技术变革的步伐如此之快，以至于那些不愿欣然接受变革的人远远落在了后面。<br>\nThe pace of change in information technology is so rapid that it leaves those who do not readily embrace the change far behind.</p>\n<p>普通人对成功是如此的渴望，结果为了达到成功愿意牺牲很多事情，甚至包括自己的良知和健康。<br>\nOrdinary people are so eager for success that they are willing to sacrifice many things, even including their conscience and health.</p>\n<h3><span id=\"so-adjadv移到句首时主要从句的主语与be动词或主动词必须倒装\"><code>so + adj./adv.移到句首时，主要从句的主语与be动词或主动词必须倒装。</code></span></h3>\n<p>我们的环境保护太没有成效，以至于我们被污染的河流和污浊的空气所包围。<br>\nSo inefficient is our environmental protection that we are surrounded by polluted rivers and dirty air.</p>\n<p>我们对青少年心理健康的关注太少，所以很多人不知道青少年为何要犯罪。<br>\nSo little do we pay attention to the mental health of adolescents that many people do not even know why teenagers commit  crimes.</p>\n<h2><span id=\"8-the-more-the-more\">8. the more…, the more…</span></h2>\n<h3><span id=\"the-more-s-v-the-比较级-s-v该句型如果more后面跟的都是形容词可以写成这样\"><code>the more + S. + V., the + 比较级 + S. + V.，该句型如果more后面跟的都是形容词，可以写成这样：</code></span></h3>\n<p>电子设备的画面越生动，沉溺于虚拟世界的人就越多。<br>\nThe more vivid the picture of the electronic device (is), the more people indulge in the virtual world.</p>\n<h3><span id=\"如果动词为be动词可以省略可以写成\"><code>如果动词为be动词，可以省略，可以写成：</code></span></h3>\n<p>数据显示，工作节奏越快的人，身体状况越糟糕。<br>\nStatistics show that the more faster the pace of work (is), the worse people’s physical condition (is).</p>\n<h3><span id=\"当然可以把宾语提到more后面让more直接跟名词-所以可以写成\"><code>当然，可以把宾语提到more后面，让more直接跟名词。所以可以写成：</code></span></h3>\n<p>家长让孩子自己做选择的机会越多，孩子的独立性越强。<br>\nThe more opportunities parents give their children to make their own choices, the stronger their independence (is).</p>\n<p>我们对环境问题关注地越多，政府会越快建立保护环境的法律法规。<br>\nThe more attention we pay to the environmental issues, the faster the government introduce laws and regulations to protect the environment.</p>\n<h2><span id=\"9-whenever\">9. whenever</span></h2>\n<h3><span id=\"mark-twain说过这样一句话whenever-you-find-that-you-are-on-the-side-of-the-majority-it-is-time-to-reform每当你发现跟大多数人站在同一边时就是改革的时候了\"><code>Mark Twain说过这样一句话：Whenever you find that you are on the side of the majority, it is time to reform.每当你发现跟大多数人站在同一边时，就是改革的时候了。</code></span></h3>\n<h3><span id=\"这个句子中-whenever是个连词表示每当无论何时它可以引导时间状语从句\"><code>这个句子中， whenever是个连词，表示“每当，无论何时”，它可以引导时间状语从句。</code></span></h3>\n<p>每当看到原本清澈的河水被严重污染，我就感到心碎。<br>\nWhenever I see the once clear water is heavily polluted, I feel heartbreaking.</p>\n<p>每当孩子厌学时，家长和学校就该反思他们的教育方法。<br>\nWhenever children are tired of learning, parents and the school should reflect on their teaching methods.</p>\n<p>每当我收到来自电商平台的包裹，我都控制不住为自己生活在数字时代而感到高兴。<br>\nWhenever I receive a package from an e-commerce platform, I can’t help but feel happy about living in the digital age.</p>\n<p>当你睡不着觉的时候，你可以听一些音乐或者喝一杯热牛奶。<br>\nWhenever you cannot fall asleep, you can listen to some soft music or drink a glass of hot milk.</p>\n","prev":{"title":"蓝桥杯刷题（BEGIN）","link":"2020/01/19/lanqiao01"},"next":{"title":"数组和字符串","link":"2019/11/14/for-competition02"},"plink":"https://venanastasia.github.io/2019/11/19/sentence05/","toc":[{"id":null,"title":"How does the book look like?","index":"1"},{"id":null,"title":"How to get one?","index":"2"}],"copyright":{"author":"loving-English Anastasia","license":"Attribution-NonCommercial-NoDerivatives 4.0 International"}}